toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        } else if (!comp) {
            // Both a and b are invalid; reset them both
            a = {};
            b = {};
        }
    }
    
    static void _ImgRingBufIncrement() {
        FRAMWriteEn writeEn; // Enable FRAM writing
        MSP::ImgRingBuf ringBufCopy = _State.sd.imgRingBufs[0];
        
        // Update write index
        ringBufCopy.buf.widx++;
        // Wrap widx
        if (ringBufCopy.buf.widx >= _State.sd.imgCap) ringBufCopy.buf.widx = 0;
        
        // Update read index (if we're currently full)
        if (ringBufCopy.buf.full) {
            ringBufCopy.buf.ridx++;
            // Wrap ridx
            if (ringBufCopy.buf.ridx >= _State.sd.imgCap) ringBufCopy.buf.ridx = 0;
            
            // Update the beginning image id (which only gets incremented if we're full)
            ringBufCopy.buf.idBegin++;
        }
        
        // Update the end image id (the next image id that'll be used)
        ringBufCopy.buf.idEnd++;
        
        if (ringBufCopy.buf.widx == ringBufCopy.buf.ridx) ringBufCopy.buf.full = true;
        
        _State.sd.imgRingBufs[0] = ringBufCopy;
        _State.sd.imgRingBufs[1] = ringBufCopy;
    }
    
    // _RCA: SD card 'relative card address'; needed for SD comms after initialization.
    // As an optional, _RCA also signifies whether we've successfully initiated comms
    // with the SD card since the battery was plugged in.
    // Stored in BAKMEM (RAM that's retained in LPM3.5) so that it's maintained during
    // sleep, but reset upon a cold start.
    [[gnu::section(".ram_backup.main")]]
    static inline std::optional<uint16_t> _RCA;
    
    static inline bool _Writing = false;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._SDTask")]]
    static inline uint8_t Stack[256];
};

struct _ImgTask {
    static void Init() {
        Wait();
        _Scheduler::Start<_ImgTask>([] { _Init(); });
    }
    
    static void Capture(const Img::Id& id) {
        Wait();
        
        static struct { Img::Id id; } Args;
        Args = { id };
        _Scheduler::Start<_ImgTask>([] { _Capture(Args.id); });
    }
    
    static uint8_t CaptureBlock() {
        Wait();
        return _CaptureBlock;
    }
    
    static void Wait() {
        _Scheduler::Wait<_ImgTask>();
    }
    
    static void _Init() {
        // Initialize image sensor
        _ImgSensor::Init();
        // Set the initial exposure _before_ we enable streaming, so that the very first frame
        // has the correct exposure, so we don't have to skip any frames on the first capture.
        _ImgSensor::SetCoarseIntTime(_AutoExp.integrationTime());
        // Enable image streaming
        _ImgSensor::SetStreamEnabled(true);
    }
    
    static void _Capture(const Img::Id& id) {
        // Try up to `CaptureAttemptCount` times to capture a properly-exposed image
        constexpr uint8_t CaptureAttemptCount = 3;
        uint8_t bestExpBlock = 0;
        uint8_t bestExpScore = 0;
        for (uint8_t i=0; i<CaptureAttemptCount; i++) {
            // skipCount:
            // On the initial capture, we didn't set the exposure, so we don't need to skip any images.
            // On subsequent captures, we did set the exposure before the capture, so we need to skip a single
            // image since the first image after setting the exposure is invalid.
            const uint8_t skipCount = (!i ? 0 : 1);
            
            // expBlock: Store images in the block belonging to the worst-exposed image captured so far
            const uint8_t expBlock = !bestExpBlock;
            
            // Populate the header
            static Img::Header header = {
                .magic          = Img::Header::MagicNumber,
                .version        = Img::Header::Version,
                .imageWidth     = Img::Full::PixelWidth,
                .imageHeight    = Img::Full::PixelHeight,
                .coarseIntTime  = 0,
                .analogGain     = 0,
                .id             = 0,
                .timestamp      = 0,
            };
            
            header.coarseIntTime = _AutoExp.integrationTime();
            header.id = id;
            header.timestamp = _RTC.time();
            
            // Capture an image to RAM
            const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, expBlock, skipCount);
            const uint8_t expScore = _AutoExp.update(resp.highlightCount(), resp.shadowCount());
            if (!bestExpScore || (expScore > bestExpScore)) {
                bestExpBlock = expBlock;
                bestExpScore = expScore;
            }
            
            // We're done if we don't have any exposure changes
            if (!_AutoExp.changed()) break;
            
            // Update the exposure
            _ImgSensor::SetCoarseIntTime(_AutoExp.integrationTime());
        }
        
        _CaptureBlock = bestExpBlock;
    }
    
    static inline uint8_t _CaptureBlock = 0;
    
    // _AutoExp: auto exposure algorithm object
    // Stored in BAKMEM (RAM that's retained in LPM3.5) so that
    // it's maintained during sleep, but reset upon a cold start.
    // This is so we don't forget exposure levels between captures,
    // since the exposure doesn't change often.
    [[gnu::section(".ram_backup.main")]]
    static inline Img::AutoExposure _AutoExp;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._ImgTask")]]
    static inline uint8_t Stack[256];
};

struct _I2CTask {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::Echo:
            return MSP::Resp{
                .ok = true,
                .arg = {
                    .Echo = {
                        .data = cmd.arg.Echo.data,
                    },
                },
            };
        
        case Cmd::Op::LEDSet:
            _Pin::LED_RED_::Write(!cmd.arg.LEDSet.red);
            _Pin::LED_GREEN_::Write(!cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true, };
        
        case Cmd::Op::HostModeSet:
            // TODO: implement
        
        case Cmd::Op::VDDIMGSDSet:
            _VDDIMGSDSet(cmd.arg.VDDIMGSDSet.en);
            return MSP::Resp{ .ok = true, };
        
        case Cmd::Op::BatterySample:
            // TODO: implement
        
        default:
            return MSP::Resp{
                .ok = false,
            };
        }
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .AutoStart = Run, // Task should start running
    };
    
