toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._I2CTask")]]
    static inline uint8_t Stack[256];
};

struct _MainTask {
    static void Run() {
        
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Sleep(_Scheduler::Ms(250));
//        
//        for (;;) {
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//        }
        
        // TODO: remove
        for (;;) {
            _Scheduler::Sleep(_Scheduler::Ms(1000));
        }
        
        const MSP::ImgRingBuf& imgRingBuf = _State.sd.imgRingBufs[0];
        
        // Init SPI peripheral
        _SPI::Init();
        
        for (;;) {
//            // Wait for motion. During this block we allow LPM3.5 sleep, as long as our other tasks are idle.
//            {
//                _WaitingForMotion = true;
//                _Scheduler::Wait([&] { return (bool)_Motion; });
//                _Motion = false;
//                _WaitingForMotion = false;
//            }
            
            // Turn on VDD_B power (turns on ICE40)
            _VDDBSet(true);
            
            // Wait for ICE40 to start
            // We specify (within the bitstream itself, via icepack) that ICE40 should load
            // the bitstream at high-frequency (40 MHz).
            // According to the datasheet, this takes 70ms.
            _Scheduler::Sleep(_Scheduler::Ms(30));
            _ICEInit();
            
            // Reset SD nets before we turn on SD power
            _SDTask::Reset();
            _SDTask::Wait();
            
            // Turn on IMG/SD power
            _VDDIMGSDSet(true);
            
            // Init image sensor / SD card
            _ImgTask::Init();
            _SDTask::Init();
            
            for (;;) {
                // Capture an image
                {
                    _Pin::LED_GREEN_::Write(0);
                    
                    // Wait for _SDTask to be initialized and done with writing, which is necessary
                    // for 2 reasons:
                    //   1. we have to wait for _SDTask to initialize _State.sd.imgRingBufs before we
                    //      access it,
                    //   2. we can't initiate a new capture until writing to the SD card (from a
                    //      previous capture) is complete (because the SDRAM is single-port, so
                    //      we can only read or write at one time)
                    _SDTask::WaitForInitAndWrite();
                    
                    // Capture image to RAM
                    _ImgTask::Capture(imgRingBuf.buf.idEnd);
                    const uint8_t srcRAMBlock = _ImgTask::CaptureBlock();
                    
                    // Copy image from RAM -> SD card
                    _SDTask::Write(srcRAMBlock);
                    _SDTask::Wait();
                    
                    _Pin::LED_GREEN_::Write(1);
                }
                
                break;
                
//                // Wait up to 1s for further motion
//                const auto motion = _Scheduler::Wait(_Scheduler::Ms(1000), [] { return (bool)_Motion; });
//                if (!motion) break;
//                
//                // Only reset _Motion if we've observed motion; otherwise, if we always reset
//                // _Motion, there'd be a race window where we could first observe
//                // _Motion==false, but then the ISR sets _Motion=true, but then we clobber
//                // the true value by resetting it to false.
//                _Motion = false;
            }
            
            _VDDIMGSDSet(false);
            _VDDBSet(false);
            
            _Scheduler::Sleep(_Scheduler::Ms(3000));
        }
    }
    
    static bool DeepSleepOK() {
        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
        // This logic works because if _WaitingForMotion==true, then we've disabled both _SDTask
        // and _ImgTask, so if the tasks are idle, then everything's idle so we can enter deep
        // sleep. (The case that we need to be careful of is going to sleep when either _SDTask
        // or _ImgTask is idle but still powered on, which the _WaitingForMotion check takes
        // care of.)
        return _WaitingForMotion                &&
               !_Scheduler::Running<_SDTask>()  &&
               !_Scheduler::Running<_ImgTask>() ;
    }
    
    static void MotionSignal(uint16_t iv) {
        _Motion = true;
    }
    
    // _Motion: announces that motion occurred
    // atomic because _Motion is modified from the interrupt context
    static inline std::atomic<bool> _Motion = false;
    static inline bool _WaitingForMotion = false;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .AutoStart = Run, // Task should start running
    };
    
    // Task stack
    [[gnu::section(".stack._MainTask")]]
    static inline uint8_t Stack[256];
};

// MARK: - IntState

inline bool Toastbox::IntState::InterruptsEnabled() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::SetInterruptsEnabled(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    // If deep sleep is OK, enter LPM3.5 sleep, where RAM content is lost.
    // Otherwise, enter LPM1 sleep, because something is running.
    const uint16_t LPMBits = (_MainTask::DeepSleepOK() ? LPM3_bits : LPM1_bits);
    
    // If we're entering LPM3, disable regulator so we enter LPM3.5 (instead of just LPM3)
    if (LPMBits == LPM3_bits) {
        PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
        PMMCTL0_L |= PMMREGOFF_L;
    }
    
    // Atomically enable interrupts and go to sleep
    const bool prevEn = Toastbox::IntState::InterruptsEnabled();
    __bis_SR_register(GIE | LPMBits);
    // If interrupts were disabled previously, disable them again
    if (!prevEn) Toastbox::IntState::SetInterruptsEnabled(false);
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC.isr();
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (__even_in_range(iv, 0x10)) {
    case _Pin::MOTION_SIGNAL::IVPort2():
        _MainTask::MotionSignal(iv);
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
        break;
    case _I2C::Pin::Active::IVPort2():
        _I2C::ISR_Active(iv);
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    default:
        break;
    }
}

[[gnu::interrupt(USCI_B0_VECTOR)]]
static void _ISR_USCI_B0() {
    // Accessing `UCB0IV` automatically clears the highest-priority interrupt
    const uint16_t iv = UCB0IV;
    _I2C::ISR_I2C(iv);
    // Wake ourself
    __bic_SR_register_on_exit(LPM0_bits);
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

