toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
// MARK: - Abort

namespace AbortDomain {
    static constexpr uint16_t Invalid       = 0;
    static constexpr uint16_t Main          = 1;
    static constexpr uint16_t Scheduler     = 2;
    static constexpr uint16_t ICE           = 3;
    static constexpr uint16_t SD            = 4;
    static constexpr uint16_t Img           = 5;
    static constexpr uint16_t I2C           = 6;
}

[[noreturn]]
static void _MainError(uint16_t line) {
    _Abort(AbortDomain::Main, line);
}

[[noreturn]]
static void _SchedulerError(uint16_t line) {
    _Abort(AbortDomain::Scheduler, line);
}

[[noreturn]]
static void _ICEError(uint16_t line) {
    _Abort(AbortDomain::ICE, line);
}

[[noreturn]]
static void _SDError(uint16_t line) {
    _Abort(AbortDomain::SD, line);
}

[[noreturn]]
static void _ImgError(uint16_t line) {
    _Abort(AbortDomain::Img, line);
}

[[noreturn]]
static void _I2CError(uint16_t line) {
    _Abort(AbortDomain::I2C, line);
}

static void _AbortRecord(const MSP::Time& timestamp, uint16_t domain, uint16_t line) {
    using namespace MSP;
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    AbortHistory* hist = nullptr;
    for (AbortHistory& h : _State.aborts) {
        if (!h.count || (h.type.domain == domain && h.type.line == line)) {
            hist = &h;
            break;
        }
    }
    
    // If we don't have a place to record the abort, bail
    if (!hist) return;
    
    // Prep the element if this is the first instance
    if (!hist->count) {
        hist->type = {
            .domain = domain,
            .line = line,
        };
        
        hist->timestampEarliest = timestamp;
    }
    
    hist->timestampLatest = timestamp;
    hist->count++;
}

[[noreturn]]
static void _BOR() {
    PMMCTL0 = PMMPW | PMMSWBOR;
    for (;;);
}

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line) {
    const MSP::Time timestamp = _RTC.time();
    // Record the abort
    _AbortRecord(timestamp, domain, line);
    _BOR();
}

extern "C" [[noreturn]]
void abort() {
    Assert(false);
}

// MARK: - Main

#warning verify that _StackMainSize is large enough
#define _StackMainSize 128

[[gnu::section(".stack.main")]]
uint8_t _StackMain[_StackMainSize];

asm(".global __stack");
asm(".equ __stack, _StackMain+" Stringify(_StackMainSize));

//static void _HostMode() {
//    // Let power rails fully discharge before turning them on
//    _Scheduler::Delay(_Scheduler::Ms(10));
//    
//    while (!_Pin::HOST_MODE_::Read()) {
//        _Scheduler::Delay(_Scheduler::Ms(100));
//    }
//}

int main() {
    // Stop watchdog timer
    WDTCTL = WDTPW | WDTHOLD;
    
    // Init GPIOs
    GPIO::Init<
        // General IO
        _Pin::MOTION_SIGNAL,
        _Pin::BUTTON_SIGNAL_,
        _Pin::BAT_CHRG_LVL_EN,
        _Pin::LED_GREEN_,
        _Pin::LED_RED_,
        _Pin::BAT_CHRG_LVL,
        _Pin::MOTION_EN_,
        _Pin::VDD_B_EN,
        
        // Power control
        _Pin::VDD_B_1V8_IMG_SD_EN,
        _Pin::VDD_B_2V8_IMG_SD_EN,
        
        // Clock (config chosen by _RTCType)
        _RTCType::Pin::XOUT,
        _RTCType::Pin::XIN,
        
        // SPI (config chosen by _SPI)
        _SPI::Pin::Clk,
        _SPI::Pin::DataOut,
        _SPI::Pin::DataIn,
        
        // I2C (config chosen by _I2C)
        _I2C::Pin::SCL,
        _I2C::Pin::SDA,
        _I2C::Pin::Active
    >();
    
    // Init clock
    _Clock::Init();
    
    // Init RTC
    // We need RTC to be unconditionally enabled for 2 reasons:
    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
    MSP::Time startTime = 0;
    if (_State.startTime.valid) {
        startTime = _State.startTime.time;
        
        // If `time` is valid, consume it before handing it off to _RTC.
        FRAMWriteEn writeEn; // Enable FRAM writing
        // Reset `valid` before consuming the start time, so that if we lose power,
        // the time won't be reused again
        _State.startTime.valid = false;
        std::atomic_signal_fence(std::memory_order_seq_cst);
    }
    _RTC.init(startTime);
    
    // Init SysTick
    _SysTick::Init();
    
//    {
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Delay(_Scheduler::Ms(1000));
//        
////        debugSignal();
//        
//        for (;;) {
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Delay(_Scheduler::Ms(250));
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Delay(_Scheduler::Ms(250));
//        }
//    }
    
    // Handle cold starts
    if (Startup::ColdStart()) {
//        // Temporarily enable a pullup on HOST_MODE_ so that we can determine whether STM is driving it low.
//        // We don't want the pullup to be permanent to prevent leakage current (~80nA) through STM32's GPIO
//        // that controls HOST_MODE_.
//        _Pin::HOST_MODE_::Write(1);
//        
//        // Wait for the pullup to pull the rail up
//        _Scheduler::Delay(_Scheduler::Ms(1));
//        
//        // Enter host mode if HOST_MODE_ is asserted
//        if (!_Pin::HOST_MODE_::Read()) {
//            _HostMode();
//        }
//        
//        // Return to default HOST_MODE_ config
//        // Not using GPIO::Init() here because it costs a lot more instructions.
//        _Pin::HOST_MODE_::Write(0);
        
        // Since this is a cold start, delay 3s before beginning.
        // This delay is meant for the case where we restarted due to an abort, and
        // serves 2 purposes:
        //   1. it rate-limits aborts, in case there's a persistent issue
        //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
        _Pin::LED_RED_::Write(0);
        _Scheduler::Delay(_Scheduler::Ms(3000));
        _Pin::LED_RED_::Write(1);
    }
    
    _Scheduler::Run();
}




//#warning TODO: remove these debug symbols
//#warning TODO: when we remove these, re-enable: Project > Optimization > Place [data/functions] in own section
//constexpr auto& _Debug_Tasks              = _Scheduler::_Tasks;
//constexpr auto& _Debug_DidWork            = _Scheduler::_DidWork;
//constexpr auto& _Debug_CurrentTask        = _Scheduler::_CurrentTask;
//constexpr auto& _Debug_CurrentTime        = _Scheduler::_ISR.CurrentTime;
//constexpr auto& _Debug_Wake               = _Scheduler::_ISR.Wake;
//constexpr auto& _Debug_WakeTime           = _Scheduler::_ISR.WakeTime;
//
//struct _DebugStack {
//    uint16_t stack[_StackGuardCount];
//};
//
//const _DebugStack& _Debug_MainStack               = *(_DebugStack*)_StackMain;
//const _DebugStack& _Debug_MainTaskStack         = *(_DebugStack*)_MainTask::Stack;
//const _DebugStack& _Debug_SDTaskStack             = *(_DebugStack*)_SDTask::Stack;
//const _DebugStack& _Debug_ImgTaskStack            = *(_DebugStack*)_ImgTask::Stack;
